
# tap repositories and their packages

tap 'homebrew/core'
brew 'antidote'
brew 'aria2'
brew 'atomicparsley'
brew 'bash-completion@2'
brew 'bat'
brew 'bento4'
brew 'cmake'
brew 'exercism'
brew 'eza'
brew 'fd'
brew 'ffmpeg@4'
brew 'fzf'
brew 'gdk-pixbuf'
brew 'git'
brew 'git-delta'
brew 'gsettings-desktop-schemas'
brew 'guile'
brew 'jq'
brew 'keychain'
brew 'lazygit'
brew 'mas'
brew 'neovim'
brew 'nghttp2'
brew 'ocrmypdf'
brew 'pipx'
brew 'pnpm'
brew 'poppler'
brew 'powerlevel10k'
brew 'pyenv'
brew 'pygobject3'
brew 'python-launcher'
brew 'qt'
brew 'rbenv'
brew 'redis'
brew 'ripgrep'
brew 'shellcheck'
brew 'stow'
brew 'thefuck'
brew 'tldr'
brew 'tmuxp'
brew 'trash'
brew 'tree'
brew 'vulkan-headers'
brew 'wget'
brew 'yt-dlp'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

tap 'homebrew/cask'
cask 'dbeaver-community'
cask 'font-meslo-lg-nerd-font'
cask 'iterm2'
cask 'key-codes'
cask 'masscode'
cask 'qlmarkdown'
cask 'xcodes'

tap 'homebrew/bundle'

tap 'homebrew/services'

tap 'bell-sw/liberica'
cask 'liberica-jdk17-full'

tap 'buo/cask-upgrade'

tap 'gcenx/wine'
cask 'wineskin'

tap 'homebrew-ffmpeg/ffmpeg'

tap 'jesseduffield/lazygit'

tap 'jorgelbg/tap'
brew 'pinentry-touchid'

tap 'mongodb/brew'
brew 'mongodb-community@5.0'

tap 'olets/tap'
brew 'zsh-abbr'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'sandreas/tap'

# App Store applications
mas 'Bitwarden (2024.5.0)', id: 1352778147
mas 'Contacts Sync for Google Gmail (8.3.3)', id: 451691288
mas 'CotEditor (4.8.6)', id: 1024640650
mas 'Foldor (1.3.1)', id: 1559426624
mas 'GarageBand (10.4.11)', id: 682658836
mas 'iMovie (10.4)', id: 408981434
mas 'Keynote (14.1)', id: 409183694
mas 'Numbers (14.1)', id: 409203825
mas 'Pages (14.1)', id: 409201541
mas 'PastePal (2.15.8)', id: 1503446680
mas 'Patterns (1.3)', id: 429449079
mas 'PDF Squeezer (4.5.3)', id: 1502111349
mas 'Snip (1.7)', id: 1527428847
mas 'Sync Folders Pro (4.7.4)', id: 522706442
mas 'Tipitaka Pali Reader (2.6.1)', id: 1541426949
mas 'Tomito (2.1.2)', id: 1526042938
